# SetEqualityFormula Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionType..::..SetEqualityFormula Method
DimensionType Class See Also
---
Sets an ordered list of the entries to use in the equality formula definition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public void SetEqualityFormula(
	IList<DimensionEqualityLabelFormatting> formattingArr
)
```

Visual Basic
---
```text
Public Sub SetEqualityFormula ( _
	formattingArr As IList(Of DimensionEqualityLabelFormatting) _
)
```

Visual C++
---
```text
public:
void SetEqualityFormula(
	IList<DimensionEqualityLabelFormatting^>^ formattingArr
)
```

# ### Parameters
formattingArr
    Type: System.Collections.Generic..::..IList<(Of <(<'DimensionEqualityLabelFormatting>)>)> An ordered list of the entries to use in the equality formula definition.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The input equality formula entries are not valid for use in the given DimensionType. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DimensionType Class
Autodesk.Revit.DB Namespace